<template>
  <div class="login_container">
    <!-- title:对话框左上角的标题  -->
    <!-- v-model：控制对话框显示与隐藏 -->
    <el-dialog v-model="userStore.visiable" title="用户登陆"
      ><!--  @close="close" -->
      <!-- 对话框身体部分的结构 -->
      <el-row>
        <!-- 左侧 号码登陆、微信扫一扫登陆 -->
        <el-col :span="12">
          <div class="login">
            <div v-show="scene == 0">
              <el-form :model="loginParam" :rules="rules" ref="form">
                <el-form-item prop="phone">
                  <el-input
                    placeholder="请输入手机号码"
                    :prefix-icon="User"
                    v-model="loginParam.phone"
                  ></el-input>
                </el-form-item>
                <el-form-item prop="code">
                  <el-input
                    placeholder="请输入手机验证码"
                    :prefix-icon="Lock"
                    v-model="loginParam.code"
                  ></el-input>
                </el-form-item>
                <el-form-item>
                  <!-- true 禁用 倒计时模式也要禁用 -->
                  <el-button :disabled="!isPhone || flag ? true : false">
                    <CountDown v-if="flag" :flag="flag" @getFlag="getFlag" />
                    <span v-else @click="getCode">获取验证码</span>
                  </el-button>
                </el-form-item>
              </el-form>
              <el-button
                type="primary"
                style="width: 100%"
                :disabled="
                  !isPhone || loginParam.code.length < 6 ? true : false
                "
                @click="login"
                >用户登陆</el-button
              >
              <div class="bottom" @click="changeScene">
                <p>微信扫码登陆</p>
                <svg
                  t="1693295361936"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="13319"
                  width="32"
                  height="32"
                >
                  <path
                    d="M579.584 511.488c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-76.8-171.008c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m-164.864 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m164.864 0c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m76.8 171.008c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m131.072 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m0 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m-131.072 0c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-76.8-171.008c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m-164.864 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184zM512 0C229.376 0 0 229.376 0 512s229.376 512 512 512 512-229.376 512-512S794.624 0 512 0z m-75.776 641.024c-6.656 1.024-14.336 1.024-20.992 1.024-30.72 0-53.248-5.12-82.432-13.312l-84.48 41.984 24.064-71.68c-59.392-41.984-94.208-94.208-94.208-158.72 0-113.664 107.008-200.192 236.544-200.192 115.2 0 217.6 68.096 237.568 164.864a126.523077 126.523077 0 0 0-22.528-2.56c-113.664 0-200.704 84.992-200.704 187.392 0.512 18.432 3.072 34.304 7.168 51.2z m280.064 106.496c-24.064 5.12-47.616 12.288-71.68 12.288-111.616 0-200.192-76.8-200.192-172.032s88.576-171.52 200.192-171.52c105.984 0 200.704 76.8 200.704 171.52 0 53.248-35.84 100.864-82.432 135.168l16.896 59.904-63.488-35.328z m-5.632-236.032c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m-131.072 0c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-46.592-141.824c0-18.432-11.776-29.184-30.208-29.184-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184zM337.92 340.48c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m0 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m164.864 0c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m76.8 171.008c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m131.072 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064zM337.92 340.48c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m372.736 171.008c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z"
                    fill="#0AB70E"
                    p-id="13320"
                  ></path>
                </svg>
              </div>
            </div>
            <div class="webchat" v-show="scene == 1">
              <div id="login_container"></div>
              <div class="bottom" @click="handler">
                <p>手机短信验证码登录</p>
                <svg
                  t="1693464540423"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="14793"
                  width="32"
                  height="32"
                >
                  <path
                    d="M820.409449 797.228346q0 25.19685-10.07874 46.866142t-27.716535 38.299213-41.322835 26.204724-50.897638 9.574803l-357.795276 0q-27.212598 0-50.897638-9.574803t-41.322835-26.204724-27.716535-38.299213-10.07874-46.866142l0-675.275591q0-25.19685 10.07874-47.370079t27.716535-38.80315 41.322835-26.204724 50.897638-9.574803l357.795276 0q27.212598 0 50.897638 9.574803t41.322835 26.204724 27.716535 38.80315 10.07874 47.370079l0 675.275591zM738.771654 170.330709l-455.559055 0 0 577.511811 455.559055 0 0-577.511811zM510.992126 776.062992q-21.165354 0-36.787402 15.11811t-15.622047 37.291339q0 21.165354 15.622047 36.787402t36.787402 15.622047q22.173228 0 37.291339-15.622047t15.11811-36.787402q0-22.173228-15.11811-37.291339t-37.291339-15.11811zM591.622047 84.661417q0-8.062992-5.03937-12.598425t-11.086614-4.535433l-128 0q-5.03937 0-10.582677 4.535433t-5.543307 12.598425 5.03937 12.598425 11.086614 4.535433l128 0q6.047244 0 11.086614-4.535433t5.03937-12.598425z"
                    fill="#FF0036"
                    p-id="14794"
                  ></path>
                </svg>
              </div>
            </div>
          </div>
        </el-col>
        <!-- 右侧 二维码 -->
        <el-col :span="12">
          <div class="leftContent">
            <div class="top">
              <div class="item">
                <img src="../../assets/images/code_login_wechat.png" alt="" />
                <svg
                  t="1693295361936"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="13319"
                  width="16"
                  height="16"
                >
                  <path
                    d="M579.584 511.488c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-76.8-171.008c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m-164.864 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m164.864 0c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m76.8 171.008c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m131.072 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m0 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m-131.072 0c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-76.8-171.008c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m-164.864 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184zM512 0C229.376 0 0 229.376 0 512s229.376 512 512 512 512-229.376 512-512S794.624 0 512 0z m-75.776 641.024c-6.656 1.024-14.336 1.024-20.992 1.024-30.72 0-53.248-5.12-82.432-13.312l-84.48 41.984 24.064-71.68c-59.392-41.984-94.208-94.208-94.208-158.72 0-113.664 107.008-200.192 236.544-200.192 115.2 0 217.6 68.096 237.568 164.864a126.523077 126.523077 0 0 0-22.528-2.56c-113.664 0-200.704 84.992-200.704 187.392 0.512 18.432 3.072 34.304 7.168 51.2z m280.064 106.496c-24.064 5.12-47.616 12.288-71.68 12.288-111.616 0-200.192-76.8-200.192-172.032s88.576-171.52 200.192-171.52c105.984 0 200.704 76.8 200.704 171.52 0 53.248-35.84 100.864-82.432 135.168l16.896 59.904-63.488-35.328z m-5.632-236.032c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z m-131.072 0c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m-46.592-141.824c0-18.432-11.776-29.184-30.208-29.184-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184zM337.92 340.48c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m0 0c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m164.864 0c-17.408 0-34.304 10.752-34.304 29.184 0 17.408 16.896 29.184 34.304 29.184 18.432 0 30.208-11.776 30.208-29.184 0-18.432-11.776-29.184-30.208-29.184z m76.8 171.008c-11.776 0-23.552 10.752-23.552 24.064 0 10.752 11.776 21.504 23.552 21.504 17.408 0 30.208-10.752 30.208-21.504 0-13.312-12.8-24.064-30.208-24.064z m131.072 0c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064zM337.92 340.48c-17.408 0-35.84 10.752-35.84 29.184 0 17.408 18.432 29.184 35.84 29.184 16.384 0 30.208-11.776 30.208-29.184-0.512-18.432-13.824-29.184-30.208-29.184z m372.736 171.008c-12.288 0-23.552 10.752-23.552 24.064 0 10.752 10.752 21.504 23.552 21.504 16.896 0 29.184-10.752 29.184-21.504 0-13.312-12.8-24.064-29.184-24.064z"
                    fill="#dbdbdb"
                    p-id="13320"
                  ></path>
                </svg>
                <p>微信扫一扫关注</p>
                <p>“快速预约挂号”</p>
              </div>
              <div class="item">
                <img src="../../assets/images/code_app.png" alt="" />
                <svg
                  t="1693296419940"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="14442"
                  width="16"
                  height="16"
                >
                  <path
                    d="M820.409449 797.228346q0 25.19685-10.07874 46.866142t-27.716535 38.299213-41.322835 26.204724-50.897638 9.574803l-357.795276 0q-27.212598 0-50.897638-9.574803t-41.322835-26.204724-27.716535-38.299213-10.07874-46.866142l0-675.275591q0-25.19685 10.07874-47.370079t27.716535-38.80315 41.322835-26.204724 50.897638-9.574803l357.795276 0q27.212598 0 50.897638 9.574803t41.322835 26.204724 27.716535 38.80315 10.07874 47.370079l0 675.275591zM738.771654 170.330709l-455.559055 0 0 577.511811 455.559055 0 0-577.511811zM510.992126 776.062992q-21.165354 0-36.787402 15.11811t-15.622047 37.291339q0 21.165354 15.622047 36.787402t36.787402 15.622047q22.173228 0 37.291339-15.622047t15.11811-36.787402q0-22.173228-15.11811-37.291339t-37.291339-15.11811zM591.622047 84.661417q0-8.062992-5.03937-12.598425t-11.086614-4.535433l-128 0q-5.03937 0-10.582677 4.535433t-5.543307 12.598425 5.03937 12.598425 11.086614 4.535433l128 0q6.047244 0 11.086614-4.535433t5.03937-12.598425z"
                    p-id="14443"
                    fill="#dbdbdb"
                  ></path>
                </svg>
                <p>扫一扫下载</p>
                <p>“预约挂号”APP</p>
              </div>
            </div>
            <p class="tip">尚医通官方指定平台</p>
            <p class="tip">快速挂号 安全放心</p>
          </div>
        </el-col>
      </el-row>

      <template #footer>
        <el-button type="primary" size="default" @click="closeDialog"
          >关闭窗口</el-button
        >
      </template>
    </el-dialog>
  </div>
</template>

<script setup lang="ts">
import { User, Lock } from '@element-plus/icons-vue'
import { ref, reactive, computed, watch } from 'vue'
import useUserStore from '@/store/modules/user.ts'
import { ElMessage } from 'element-plus'
import { reqWxlogin } from '@/api/hospital/index.ts'
import type { WXLoginResponseData } from './type.ts'
import { useRouter, useRoute } from 'vue-router'
let $route = useRoute()
let $router = useRouter()

//引入倒计时组件
import CountDown from '@/components/countdown/index.vue'
let userStore = useUserStore()

let scene = ref<number>(0) //0代表手机号码登陆 如果是1 代表微信扫码登陆

//定义响应式数据控制验证码倒计时--如果flag为真表示显示倒计时 为假表示不是倒计时
let flag = ref<boolean>(false)

//获取from组件实例
let form = ref<any>()

//收集表单数据--手机号phone 验证码
let loginParam = reactive({
  phone: '',
  code: '',
})
//计算表单元素收集的手机号是否合理
let isPhone = computed(() => {
  //手机号码的正则表达式
  const reg =
    /^1((34[0-8])|(8\d{2})|(([35][0-35-9]|4[579]|66|7[35678]|9[1389])\d{1}))\d{7}$/
  //返回相应的布尔值 true:代表是手机号码 false:代表不是手机号码
  return reg.test(loginParam.phone)
})

//改变登陆方式
const changeScene = async () => {
  //切换场景1
  scene.value = 1
  //发请求获取微信扫码需要的参数--需要携带参数
  //重定向到哪个页面
  let redirect_URL = encodeURIComponent(window.location.origin + '/wxlogin')
  let result: WXLoginResponseData = await reqWxlogin(redirect_URL)
  /* console.log(result) */
  //生成登陆二维码页面
  //@ts-ignore
  new WxLogin({
    self_redirect: true, //true:手机点击确认登录后可以在 iframe 内跳转到 redirect_uri
    id: 'login_container', //显示二维码容器设置
    appid: result.data.appid, //应用唯一标识appid
    scope: 'snsapi_login', //当前微信扫码登录页面已经授权了
    redirect_uri: result.data.redirectUri, //填写授权回调域路径,就是用户授权成功以后，微信服务器向公司后台推送code地址
    state: result.data.state, //state就是学校服务器重定向的地址携带用户信息
    style: 'black',
    href: '',
  })
}

//获取验证码的回调
const getCode = async () => {
  //解决element-plus按钮禁用还能点击的问题
  if (!isPhone.value || flag.value) return
  //开启倒计时模式,倒计时组件显示
  flag.value = true
  /* alert(123) */
  try {
    //获取验证码成功
    await userStore.getCode(loginParam.phone)
    loginParam.code = userStore.code
  } catch (error) {
    ElMessage({
      type: 'error',
      message: (error as Error).message,
    })
  }
}
//计时器子组件绑定的自定义事件
const getFlag = (val: boolean) => {
  flag.value = val
}
//点击用户登陆按钮回调
const login = async () => {
  //保证表单校验两项都符合条件
  await form.value.validate()

  /* alert(123) */
  //发起登录请求
  //请求成功：顶部组件显示名字，对话框关闭
  //请求失败，弹出对于登录失败信息
  try {
    await userStore.userLogin(loginParam)
    //关闭对话框
    userStore.visiable = false
    //获取url 的query参数
    let redirect = $route.query.redirect
    if (redirect) {
      $router.push(redirect)
    } else {
      $router.push('/home')
    }
  } catch (error) {
    ElMessage({
      type: 'error',
      message: (error as Error).message,
    })
  }
}
//自定义手机号校验规则函数
const validatorPhone = (rule: any, value: any, callback: any) => {
  //rule:表单校验规则对象
  //value：当前文本内容
  //callback：回调函数
  const reg =
    /^1((34[0-8])|(8\d{2})|(([35][0-35-9]|4[579]|66|7[35678]|9[1389])\d{1}))\d{7}$/

  if (reg.test(value)) {
    callback() //是手机号码就放行
  } else {
    callback(new Error('请输入正确的手机号码格式'))
  }
}
//自定义验证码校验规则
const validatorCode = (rule: any, value: any, callback: any) => {
  if (/^\d{6}$/.test(value)) {
    callback()
  } else {
    callback(new Error('请输入正确的验证码格式'))
  }
}

//表单校验的规则
const rules = {
  //手机号码的校验规则 required：表示当前字段务必进行校验 message：代表显示的提示 trigger:表单校验的触发的时机 change（文本发生变化时进行校验）/blur（失去焦点时触发校验）
  //min：最小位数 max：最大长度
  //这种方式不实用--只能约束校验长度 不能校验是否是手机号码
  /* phone: [
    {
      required: true,
      message: '手机号码必须是11位',
      trigger: 'change',
      min: 11,
    },
  ],
  code: [
    {
      equired: true,
      message: '验证码必须是6位',
      trigger: 'blur',
      min: 6,
    },
  ], */
  //自定义校验规则
  phone: [{ trigger: 'change', validator: validatorPhone }],
  code: [{ trigger: 'change', validator: validatorCode }],
}
/* //关闭对话框的回调
const close = () => {
  //清空手机的数据 Object.assign() 方法用于将所有可枚举属性的值从一个或多个源对象复制到目标对象。
  Object.assign(loginParam, { phone: '', code: '' })
  //清除上一次校验的结果 form表单提供的方法
  form.value.resetFields()
} */
//关闭窗口按钮的回调
const closeDialog = () => {
  userStore.visiable = false
  /* //清空手机的数据 Object.assign() 方法用于将所有可枚举属性的值从一个或多个源对象复制到目标对象。
  Object.assign(loginParam, { phone: '', code: '' })
  //清除上一次校验的结果 form表单提供的方法
  form.value.resetFields() */
}

//切换为手机登陆页面
const handler = () => {
  scene.value = 0
}
//监听场景数值
watch(
  () => scene.value,
  (val: number) => {
    if (val == 1) {
      userStore.queryState()
    }
  }
)
</script>

<style scoped lang="scss">
.login_container {
  /* 深度选择器 */
  ::v-deep(.el-dialog__body) {
    border-top: 1px solid #ccc;
    border-bottom: 1px solid #ccc;
  }

  .login {
    padding: 20px;
    border: 1px solid #ccc;
  }
  .bottom {
    display: flex;
    flex-direction: column;
    align-items: center;

    p {
      margin: 10px 0px;
    }
  }

  .leftContent {
    .top {
      display: flex;
      justify-content: space-around; /* 两端对齐，项目之间的间隔都相等 */
      .item {
        display: flex;
        flex-direction: column;
        align-items: center;
        img {
          width: 130px;
          height: 130px;
        }
        p {
          margin: 5px 0px;
        }
      }
    }
    .tip {
      margin: 20px 0px;
      text-align: center;
      font-size: 20px;
      font-weight: 900;
    }
  }
}
</style>
